# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSet..::..Insert Method
TemperatureRatingTypeSet Class See Also
---
Insert the specified TemperatureRating type into the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	TemperatureRatingType item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As TemperatureRatingType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	TemperatureRatingType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..TemperatureRatingTypeThe TemperatureRating type to be inserted into the set.
# ### Return Value
Returns whether the TemperatureRating type was inserted into the set.
# See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace